// Что выведет данная программа и почему?
package main

import "fmt"

func main() {
	n := 0
	if true {
		n := 1
		n++
	}
	fmt.Println(n)
}

// При выполнении блока if внутри функции main, создается новая локальная переменная n
// с инициализацией значением 1 (n := 1). Затем у этой локальной переменной увеличивается значение (n++),
// но эти изменения остаются ограниченными только блоком if.

// Поэтому при вызове fmt.Println(n) после блока if, программа обращается к глобальной переменной n,
// которая остается неизменной и всегда имеет значение 0.

// Таким образом, выводом программы будет "0".
