// 10. Что выведет данная программа и почему?

package main

import "fmt"

func update(p *int) {
	b := 2
	p = &b
}
func main() {
	var (
		a = 1
		p = &a
	)
	fmt.Println(*p)
	update(p)
	fmt.Println(*p)
}

// выводит 1 1
// При вызове функции update(p), переменная p в функции update
// получает адрес локальной переменной b. Однако, после выхода из функции update,
// эта локальная переменная b уничтожается, и указатель p в функции main остается указывать на переменную a.

// Таким образом, оба вызова fmt.Println(*p) выводят значение переменной a, которая равна 1.
