// Какой размер у структуры struct{}{}?

// Структура struct{}{} не содержит полей, поэтому ее размер в памяти равен нулю.
// Это так называемая "пустая структура" или "sentinel struct".
// Она может быть полезна, когда нужно создать канал или мапу,
// которые служат в качестве флагов или просто сигнализируют
// о наличии события без передачи каких-либо данных.
// Такая структура не занимает лишнего места в памяти.

package main

import (
	"fmt"
	"sync"
	"time"
)

func main() {
	var wg sync.WaitGroup
	eventCh := make(chan struct{}) // Создаем канал с пустой структурой

	wg.Add(1) // Увеличиваем ожидаемое количество горутин

	go func() {
		defer wg.Done()
		fmt.Println("Горутина 1: ожидание события...")
		<-eventCh // Ожидаем событие
		fmt.Println("Горутина 1: получено событие!")
	}()

	wg.Add(1)

	go func() {
		defer wg.Done()
		fmt.Println("Горутина 2: ожидание события...")
		<-eventCh
		fmt.Println("Горутина 2: получено событие!")
	}()

	// Генерируем событие через некоторое время
	time.Sleep(2 * time.Second)
	fmt.Println("Генерация события...")
	close(eventCh) // Закрываем канал, чтобы передать событие

	wg.Wait() // Ждем завершения горутин
}

// В этом примере создается канал с пустой структурой eventCh.
// Две горутины ожидают события, читая из этого канала.
// После некоторого времени происходит генерация события путем
// закрытия канала eventCh. Обе горутины получают событие и выводят
// сообщение.

// пустая структура struct{}{}
// используется для создания канала,
// который служит в качестве сигнализации
// о наличии событий без передачи дополнительных данных.
