// Реализовать собственную функцию sleep
package main

import (
	"fmt"
	"time"
)

// Функция Sleep реализует паузу в выполнении программы на указанное количество секунд
func Sleep(seconds int) {
	// time.Duration - тип данных для представления временных интервалов
	// time.Second - константа, представляющая одну секунду

	// Преобразуем количество секунд во временной интервал, используя time.Second
	duration := time.Duration(seconds) * time.Second

	// Используем функцию time.Sleep для остановки выполнения программы
	// на указанное количество временных интервалов
	time.Sleep(duration)
}

func main() {
	fmt.Println("Начало программы")
	Sleep(5) // Приостанавливаем выполнение программы на 5 секунд
	fmt.Println("Прошло 5 секунд")
	fmt.Println("Конец программы")
}
