// 13. Что выведет данная программа и почему?
package main

import "fmt"

func someAction(v []int8, b int8) {
	v[0] = 100
	v = append(v, b)
}
func main() {
	var a = []int8{1, 2, 3, 4, 5}
	someAction(a, 6)
	fmt.Println(a)
}

// Данная программа выведет [100, 2, 3, 4, 5].

// В функции someAction, переменная v является срезом []int8, и передается по значению.
// Поэтому изменение элемента v[0] внутри функции someAction изменит значение исходного среза a,
// так как это ссылка на один и тот же массив в памяти.

// Однако, при вызове append(v, b) внутри функции someAction, создается новый срез v с добавленным элементом b.
// Но этот новый срез не влияет на исходный срез a, так как v в функции someAction имеет свою собственную область видимости
// и не влияет на переменную a в функции main.

// Таким образом, после выполнения функции someAction, в fmt.Println(a) будет выведено значение измененного среза a, а именно [100, 2, 3, 4, 5].
